---
kind: method
id: M:Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor(Autodesk.Revit.DB.AlphanumericRevisionSettings)
source: html/66655e14-c46b-56c8-bda1-9fb36d7ecfda.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor Method

Constructs a new copy of the input AlphanumericRevisionSettings object.

## Syntax (C#)
```csharp
public AlphanumericRevisionSettings(
	AlphanumericRevisionSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.AlphanumericRevisionSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - other is not a valid AlphanumericRevisionSettings.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null